NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32MG24/EFR32MG24A020F1536IM48.svd
                  <name>WIREDANDALTPULLUP</name>
                  <description>Open-drain output using alternate control with pullup.</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDALTPULLUPFILTER</name>
                  <description>Open-drain output using alternate control with filter and pullup.</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTD_DOUT</name>
          <description>data out</description>
          <addressOffset>0x0D0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>
          <fields>
            <field>
              <name>DOUT</name>
              <description>Data output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTD_DIN</name>
          <description>data in</description>
          <addressOffset>0x0D4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>
          <fields>
            <field>
              <name>DIN</name>
              <description>Data input</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCK</name>
          <description>No Description</description>
          <addressOffset>0x300</addressOffset>
          <access>write-only</access>
          <resetValue>0x0000A534</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>LOCKKEY</name>
              <description>Configuration Lock Key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNLOCK</name>
                  <description>Unlock code</description>
                  <value>42292</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOLOCKSTATUS</name>
          <description>No Description</description>
          <addressOffset>0x310</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>LOCK</name>
              <description>GPIO LOCK status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNLOCKED</name>
                  <description>Registers are unlocked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED</name>
                  <description>Registers are locked</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ABUSALLOC</name>
          <description>A Bus allocation</description>
          <addressOffset>0x320</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0F0F0F0F</resetMask>
          <fields>
            <field>
              <name>AEVEN0</name>
              <description>A Bus Even 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRISTATE</name>
                  <description>The bus is not allocated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0</name>
                  <description>The bus is allocated to ADC0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP0</name>
                  <description>The bus is allocated to ACMP0</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP1</name>
                  <description>The bus is allocated to ACMP1</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDAC0CH0</name>
                  <description>The bus is allocated to VDAC0 CH0</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDAC1CH0</name>
                  <description>The bus is allocated to VDAC1 CH0</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIAGA</name>
                  <description>The bus is allocated to DIAGA</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBUG</name>
                  <description>DEBUG mode, bus allocated to all clients</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AEVEN1</name>
              <description>A Bus Even 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRISTATE</name>
                  <description>The bus is not allocated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0</name>
                  <description>The bus is allocated to ADC0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP0</name>
                  <description>The bus is allocated to ACMP0</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP1</name>
                  <description>The bus is allocated to ACMP1</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDAC0CH1</name>
                  <description>The bus is allocated to VDAC0 CH1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDAC1CH1</name>
                  <description>The bus is allocated to VDAC1 CH1</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBUG</name>
                  <description>DEBUG mode, bus allocated to all clients</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AODD0</name>
              <description>A Bus Odd 0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRISTATE</name>
                  <description>The bus is not allocated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0</name>
                  <description>The bus is allocated to ADC0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP0</name>
                  <description>The bus is allocated to ACMP0</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP1</name>
                  <description>The bus is allocated to ACMP1</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDAC0CH0</name>
                  <description>The bus is allocated to VDAC0 CH0</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDAC1CH0</name>
                  <description>The bus is allocated to VDAC1 CH0</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIAGA</name>
                  <description>The bus is allocated to DIAGA</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBUG</name>
                  <description>DEBUG mode, bus allocated to all clients</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AODD1</name>
              <description>A Bus Odd 1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRISTATE</name>
                  <description>The bus is not allocated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0</name>
                  <description>The bus is allocated to ADC0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP0</name>
                  <description>The bus is allocated to ACMP0</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP1</name>
                  <description>The bus is allocated to ACMP1</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDAC0CH1</name>
                  <description>The bus is allocated to VDAC0 CH1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDAC1CH1</name>
                  <description>The bus is allocated to VDAC1 CH1</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBUG</name>
                  <description>DEBUG mode, bus allocated to all clients</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BBUSALLOC</name>
          <description>B Bus allocation</description>
          <addressOffset>0x324</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0F0F0F0F</resetMask>
          <fields>
            <field>
              <name>BEVEN0</name>
              <description>B Bus Even 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRISTATE</name>
                  <description>The bus is not allocated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0</name>
                  <description>The bus is allocated to ADC0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP0</name>
                  <description>The bus is allocated to ACMP0</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP1</name>
                  <description>The bus is allocated to ACMP1</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDAC0CH0</name>
                  <description>The bus is allocated to VDAC0 CH0</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDAC1CH0</name>
                  <description>The bus is allocated to VDAC1 CH0</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBUG</name>
                  <description>DEBUG mode, bus allocated to all clients</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BEVEN1</name>
              <description>B Bus Even 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRISTATE</name>
                  <description>The bus is not allocated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0</name>
                  <description>The bus is allocated to ADC0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP0</name>
                  <description>The bus is allocated to ACMP0</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP1</name>
                  <description>The bus is allocated to ACMP1</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDAC0CH1</name>
                  <description>The bus is allocated to VDAC0 CH1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDAC1CH1</name>
                  <description>The bus is allocated to VDAC1 CH1</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBUG</name>
                  <description>DEBUG mode, bus allocated to all clients</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BODD0</name>
              <description>B Bus Odd 0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRISTATE</name>
                  <description>The bus is not allocated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0</name>
                  <description>The bus is allocated to ADC0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP0</name>
                  <description>The bus is allocated to ACMP0</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP1</name>
                  <description>The bus is allocated to ACMP1</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDAC0CH0</name>
                  <description>The bus is allocated to VDAC0 CH0</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDAC1CH0</name>
                  <description>The bus is allocated to VDAC1 CH0</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBUG</name>
                  <description>DEBUG mode, bus allocated to all clients</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BODD1</name>
              <description>B Bus Odd 1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRISTATE</name>
                  <description>The bus is not allocated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0</name>
                  <description>The bus is allocated to ADC0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP0</name>
                  <description>The bus is allocated to ACMP0</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP1</name>
                  <description>The bus is allocated to ACMP1</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDAC0CH1</name>
                  <description>The bus is allocated to VDAC0 CH1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDAC1CH1</name>
                  <description>The bus is allocated to VDAC1 CH1</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBUG</name>
                  <description>DEBUG mode, bus allocated to all clients</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
